artilleryTests/test.yml
config:
  target: 'http://localhost:3030'  # target site
  phases:
    - duration: 5 # time in seconds
      arrivalRate: 5 # how many are made each seconds
  defaults:
    headers:
      # x-my-service-auth: '987401838271002188298567' # header that is sent with each request
scenarios: # different flows through the website
  - flow:
    - get:  # type of request
        url: "/random"